# MUSIC
cask "spotify"

# DEVELOPMENT
## Python
brew "python@3.11"
brew "pre-commit"
brew "semgrep"
vscode "charliermarsh.ruff"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "toughtype.pydance"

## DevOps
brew "awscli"
brew "colima", restart_service: :changed
brew "docker", link: false
cask "docker-desktop"
brew "kubernetes-cli"
brew "kubectx"
brew "skaffold"
brew "terraform"
brew "terragrunt"
brew "tflint"
# Plugin for AWS CLI to start and end sessions that connect to managed instances.
cask "session-manager-plugin"

## Git
brew "git"
brew "git-delta"  # Syntax-highlighting pager for git and diff output.
vscode "eamodio.gitlens"

## GitHub
brew "gh"
brew "act"
brew "actionlint"

## Shell
brew "bash"
brew "bash-completion@2"
brew "shellcheck"
brew "shellspec"
brew "starship"
brew "tmux"
cask "alacritty"

## Editors
brew "neovim"
brew "vim"
vscode "vscodevim.vim"

## Java
brew "openjdk"
brew "maven"

## Go
brew "go@1.20"

## Node.js
brew "nvm"

## API development
cask "bruno"

## Makefile
brew "checkmake"

## Build Tools & Libraries
cask "pants"
tap "pantsbuild/tap"
brew "pkgconf"
brew "libtool"
brew "protobuf"
brew "libffi"
# C/C++ and Java libraries for Unicode and globalization.
brew "icu4c@76"

## Testing
vscode "hbenl.vscode-test-explorer"
vscode "ms-vscode.test-adapter-converter"

## Development Tools
brew "direnv"
brew "fzf"
# Clone of cat(1) with syntax highlighting and Git integration.
brew "bat"
# Search tool like grep and The Silver Searcher.
brew "ripgrep"
brew "jq"
brew "yq"
# Reimplementation of ctags(1).
brew "ctags"
# Find and verify credentials.
brew "trufflehog"
brew "vale"
brew "mkcert"
# Temporal CLI (tctl).
brew "tctl"
brew "mutagen-io/mutagen/mutagen"
tap "mutagen-io/mutagen"
cask "claude-code"
cask "cursor-cli"
vscode "anysphere.cursorpyright"
vscode "ms-vscode.makefile-tools"
tap "stripe/stripe-cli"

# SYSTEM & UTILITIES
brew "coreutils"
brew "curl"
brew "wget"
brew "rsync"
brew "htop"
brew "nmap"
brew "watch"
brew "cairo"
brew "graphviz"
brew "imagemagick"
brew "poppler"
brew "xdot"
tap "koekeishiya/formulae"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "qemu"
brew "fontconfig"
cask "font-hack-nerd-font"
cask "gpg-suite-no-mail"
cask "karabiner-elements"

# COMMUNICATION
cask "signal"
cask "slack"
cask "telegram"
cask "zoom"

# PRODUCTIVITY
cask "thunderbird"
cask "google-drive"
cask "grammarly-desktop"

# DOCUMENTATION & READING
brew "pandoc"
brew "plantuml"
cask "calibre"
cask "foxitreader"
cask "basictex"

# WEB & BROWSING
cask "google-chrome"
